load-testing/artillery-load-test.yml
config:
  target: "http://localhost:3000"
  phases:
    - duration: 60
      arrivalRate: 10
      rampTo: 100
      name: "Ramp up to 100 users"
  processor: "./artillery-processor.js"
  plugins:
    websocket: {}
scenarios:
  - name: "WebSocket and HTTP API Load Test"
    flow:
      - get:
          url: "/api/game/state"
      - get:
          url: "/api/results/rankings"
      - get:
          url: "/api/results/leaderboard"
      - get:
          url: "/api/economic-model/health"
      - think: 2
      - websocket:
          connect: "ws://localhost:3000/socket.io/?EIO=4&transport=websocket"
          onConnected:
            - emit:
                channel: "startGame"
                data: {}
            - think: 1
            - emit:
                channel: "advanceRound"
                data: {}
            - think: 2
            - close: {}